# 1. Importing Pandas

In [1]:
import pandas as pd

Explanation:
Loads the Pandas library so we can work with DataFrames.

# 2. Creating a DataFrame

In [2]:
data = {
    "Name": ["Ali", "Sara", "John"],
    "Age": [25, 30, 28],
    "City": ["Delhi", "Hyderabad", "Mumbai"]
}

df = pd.DataFrame(data)
df

   Name  Age       City
0   Ali   25      Delhi
1  Sara   30  Hyderabad
2  John   28     Mumbai

Explanation:
Creates a small table from a Python dictionary.

# 3.Basic Data Inspection

In [3]:
df.head()        # first 5 rows
df.tail()        # last 5 rows
df.info()        # column types + summary
df.describe()    # statistics

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

             Age
count   3.000000
mean   27.666667
std     2.516611
min    25.000000
25%    26.500000
50%    28.000000
75%    29.000000
max    30.000000

# 4.Selecting Columns

In [4]:
df["Name"]
df[["Name", "City"]]

   Name       City
0   Ali      Delhi
1  Sara  Hyderabad
2  John     Mumbai

# 5.Filtering Rows

In [5]:
df[df["Age"] > 25]

   Name  Age       City
1  Sara   30  Hyderabad
2  John   28     Mumbai

# 7. Adding a New Column

In [6]:
df["Age_in_5_years"] = df["Age"] + 5
df

   Name  Age       City  Age_in_5_years
0   Ali   25      Delhi              30
1  Sara   30  Hyderabad              35
2  John   28     Mumbai              33

# 8. Handling Missing Values

In [7]:
df.dropna()             # remove rows with nulls
df.fillna("Unknown")    # replace nulls with a value

   Name  Age       City  Age_in_5_years
0   Ali   25      Delhi              30
1  Sara   30  Hyderabad              35
2  John   28     Mumbai              33

# âœ… 9. Sorting Data

In [8]:
df.sort_values(by="Age", ascending=False)

   Name  Age       City  Age_in_5_years
1  Sara   30  Hyderabad              35
2  John   28     Mumbai              33
0   Ali   25      Delhi              30

# 10. Merging Two DataFrames

In [9]:
orders = pd.DataFrame({
    "OrderID": [1, 2],
    "CustomerID": [101, 102]
})

customers = pd.DataFrame({
    "CustomerID": [101, 102],
    "Name": ["Ali", "Sara"]
})

merged = pd.merge(orders, customers, on="CustomerID")
merged

   OrderID  CustomerID  Name
0        1         101   Ali
1        2         102  Sara

# 11. Grouping & Aggregation

In [10]:
df.groupby("City")["Age"].mean()

City
Delhi        25.0
Hyderabad    30.0
Mumbai       28.0
Name: Age, dtype: float64